app/Services/MercadoLivreService.php

select * from `apis` where `apis`.`id` = '3' limit 1
---
    public function getApi()
    {
        return Api::find(Cache::get('user_system_id'));

update `apis` set `access_token` = 'APP_USR-3103197680781875-041822-61b3ece373824fbd2fc17c9b804791a0-584404045', `apis`.`updated_at` = '2023-04-19 02:46:40' where `id` = 3
---
    public function refreshToken()
    {
        $api = $this->getApi();
        try {
            $cliente = new Client([
                'base_uri' => 'https://api.mercadolibre.com',
                'headers' => [
                    'Content-Type' => 'application/json',
                    'Accept' => 'application/json'
                ],
            ]);
            $response = $cliente->post('/oauth/token', [
                'json' => [
                    'grant_type' => 'refresh_token',
                    'client_id' => $api['app_id'],
                    'client_secret' => $api['secret_key'],
                    'refresh_token' => $api['refresh_token']
                ],
            ]);
            $responseBody = json_decode($response->getBody(), true);
            Api::where('id', $api['id'])->update([
                'access_token' => $responseBody['access_token']
            ]);