app/Http/Services/ProductService.php

select * from `products` where `products`.`id` = 3 limit 1
---
    public static function publishProductMeli($data)
    {

        $product = Product::query()->find($data['product_id']);

select * from `products` where `products`.`id` = 4 limit 1
---
    public static function updateProductMeli($data)
    {
        $product = Product::query()->find($data['product_id']);