app/Http/Controllers/Api/V1/AccountMeliController.php

select * from `apis` where `user_id` = 1
---
    public function index()
    {
        $api = Api::where('user_id', auth()->user()->id)->get();

select * from `apis` where `user_id` = 1 and `id` = '3'
---
    public function alterAccount($id)
    {
        $api = Api::where('user_id', auth()->user()->id)->where('id', $id)->get();

update `apis` set `status` = 'inactive', `apis`.`updated_at` = '2023-04-19 02:46:38' where `user_id` = 1
---
    public function inactiveStatus()
    {
        $status = Api::where('user_id', auth()->user()->id);
        $status->update(['status'=>'inactive']);

update `apis` set `status` = 'active', `apis`.`updated_at` = '2023-04-19 02:46:38' where `user_id` = 1 and `id` = '3'
---
    public function activeStatus($id)
    {
        $status = Api::where('user_id', auth()->user()->id)->where('id', $id);
        $status->update(['status'=>'active']);