app/Http/ApiServices/MeliService.php

    public function __construct($apiId=null)
    {
        $this->curl = curl_init();
        if($apiId)
        $settings = Api::query()->where('id', $apiId)->first();
        else
        $settings = Api::query()->where('company', 'Mercado Livre')->first();
---
select * from `apis` where `id` = 3 limit 1
select * from `apis` where `company` = 'Mercado Livre' limit 1