app/Helper/Helpers.php

select * from `messages` where `read_at` is null order by `created_at` desc
---
    public static function messageList()
    {
        return Message::whereNull('read_at')->orderBy('created_at', 'desc')->get();