app/Http/Controllers/AnnouncementController.php

select * from `apis` where `status` = 'active'
select count(*) as aggregate from `product_to_apis` inner join `products` on `products`.`id` = `product_to_apis`.`id_products` where `id_api` = '3'
---
    public function getDataIndex() {
        $accounts = Api::find(Cache::get('user_system_id'))
            ->where('status', 'active')
            ->get();

        $products = [];

        if ($this->idApi) {
            $products = ProductToApi::join("products", "products.id", "product_to_apis.id_products")
                ->where('id_api', $this->idApi)
                ->paginate(100);

select * from `brands`
select * from `products` where `id` = '1'
select * from `product_to_apis` inner join `products` on `products`.`id` = `product_to_apis`.`id_products` where `products`.`id` = '1' and `product_to_apis`.`id_api` = '3' limit 1
---
    public function edit($id, $id_api)
    {

        $brand = Brand::get();
        $category = ProductCategory::all();
        $items = Product::where('id', $id)->get();
        $product = ProductToApi::join("products", "products.id", "product_to_apis.id_products")
                ->where('products.id', $id)
                ->where('product_to_apis.id_api', $id_api)
                ->first();

select * from `apis` where `id` = '1' order by `id` desc limit 1
select * from `products` where `id` = '4' limit 1
select * from `product_to_apis` inner join `products` on `products`.`id` = `product_to_apis`.`id_products` where `products`.`id` = '4' and `product_to_apis`.`id_api` = '1' limit 1
---
    public function editMultiple($ids, $id_api) {
        $arrayIds = explode(",", $ids);
        $brand = Brand::get();
        $category = ProductCategory::all();
        $items = Product::whereIn('id', $arrayIds)->get();
        $products = [];
        foreach ($arrayIds as $id) {
            $product = ProductToApi::join("products", "products.id", "product_to_apis.id_products")
                ->where('products.id', $id)
                ->where('product_to_apis.id_api', $id_api)
                ->first();
            array_push($products, $product);
        }

        return view('backend.announcement.editMultiple')->with('products', $products)
                                                ->with('brands', $brand)
                                                ->with('categories', $category)
                                                ->with('items', $items);