app/Http/Controllers/CallbackApiController.php

select * from `apis` where `id` = '3' order by `id` desc limit 1
---
    public function refreshMercadoLivre(Request $request)
    {
        $settings = Api::query()->where('id', $request->company)->orderBy('id', 'desc')->first();