app/Http/Controllers/FrontendController.php

select * from `products` where `status` = 'active' and `is_featured` = 1 order by `price` desc limit 2
select * from `posts` where `status` = 'active' order by `id` desc limit 3
select * from `banners` where `status` = 'active' order by `id` desc limit 3
select * from `products` where `status` = 'active' order by `id` desc limit 8
select * from `categories` where `status` = 'active' and `is_parent` = 1 order by `title` asc
---
    public function home()
    {
        $featured = Product::where('status', 'active')->where('is_featured', 1)->orderBy('price', 'DESC')->limit(2)->get();
        $posts = Post::where('status', 'active')->orderBy('id', 'DESC')->limit(3)->get();
        $banners = Banner::where('status', 'active')->limit(3)->orderBy('id', 'DESC')->get();
        // return $banner;
        $products = Product::where('status', 'active')->orderBy('id', 'DESC')->limit(8)->get();
        $category = Category::where('status', 'active')->where('is_parent', 1)->orderBy('title', 'ASC')->get();