app/Http/Controllers/ProductController.php

select * from `providers`
select * from `apis`
---
    public function index()
    {
        $products = Product::getAllProduct();
        $providers = Provider::all();
        $company = Company::all()->where('active', 1);
        $settings = Api::all();

select * from `brands`
select * from `products` where `products`.`id` = '1' limit 1
select * from `products` where `id` = '1'
---
    public function edit($id)
    {
        $brand = Brand::get();
        $product = Product::findOrFail($id);
        $category = ProductCategory::all();
        $items = Product::where('id', $id)->get();

select * from `products` where `products`.`id` = '1' limit 1
update `products` set `summary` = '<p><br></p>', `cat_id` = '2', `child_cat_id` = '25', `products`.`updated_at` = '2023-04-18 22:17:37' where `id` = 1
---
    public function update(Request $request, $id)
    {
        $product = Product::findOrFail($id);
        $this->validate($request, [
            'title' => 'string|required',
            'summary' => 'string|required',
            'description' => 'string|nullable',
            'photo' => 'string|required',
            'size' => 'nullable',
            'stock' => "required|numeric",
            'cat_id' => 'required',
            'brand_id' => 'nullable',
            'child_cat_id' => 'nullable',
            'is_featured' => 'sometimes|in:1',
            'status' => 'required|in:active,inactive',
            'condition' => 'required|in:default,new,hot',
            'price_cost' => 'required|numeric',
            'discount' => 'nullable|numeric'
        ]);

        $data = $request->all();
        $data['is_featured'] = $request->input('is_featured', 0);
        $size = $request->input('size');
        if ($size) {
            $data['size'] = implode(',', $size);
        } else {
            $data['size'] = '';
        }
        $data['price']= Helpers::getPrice($data['price_cost']);
        // return $data;
        $status = $product->fill($data)->save();

select * from `product_to_apis` where `id_products` = 1 and `checked` = 1 and `id_api` = 3 order by `id` desc limit 1
---
    public function verifyProductPublish($id_product, $id_api)
    {
        return  ProductToApi::query()->where('id_products', $id_product)
            ->where("checked", true)
            ->where("id_api", $id_api)
            ->orderBy('id', 'desc')->first();

select * from `apis` where `id` = '3' order by `id` desc limit 1
select * from `products` where `id_provider` = '3'
insert into `product_to_apis` (`checked`, `id_pulish_ml`, `id_products`, `id_api`, `link_api_publish_product`, `updated_at`, `created_at`) values (1, 'MLB3292296363', 3, 3, 'http://produto.mercadolivre.com.br/MLB-3292296363-abafador-de-ruido-safety-spa3-_JM', '2023-04-19 02:54:31', '2023-04-19 02:54:31')
---
    public function publishProduct(Request $request)
    {

        $settings = Api::query()->where('id', $request->company)->orderBy('id', 'desc')->first();
        $products = Product::where("id_provider", $request->id_provider)->get();
        if ($products->count() > 0) {
            $call = new CallbackApiController();
            $call->refreshMercadoLivre($request);
        }
        $count = 0;

        foreach ($products as $key => $product) {

            // if($key <= 5974)
            // continue;

            $data = [
                "company" => $settings->company,
                "api" => $settings->id,
                "product_id" => $product->id,
                "listing_type_id" => $request->listing_type_id
            ];

            if ($this->verifyProductPublish($product->id, $settings->id) == null) {
                $prod = Product::publish($data);
            }

            if (isset($prod["success"]) and $prod["success"] == true) {
                ProductToApi::create([
                    'checked' => true,
                    'id_pulish_ml' => $prod["data"]->id,
                    'id_products' => $product->id,
                    'id_api' => $settings->id,
                    'link_api_publish_product' => $prod["data"]->permalink
                ]);