app/Http/Controllers/ProductToApiController.php

    public function index(Request $request)
    {
        $products = ProductToApi::join("products","products.id","product_to_apis.id_products")->paginate(10);
---
select * from `product_to_apis` inner join `products` on `products`.`id` = `product_to_apis`.`id_products` limit 10 offset 0
select count(*) as aggregate from `product_to_apis` inner join `products` on `products`.`id` = `product_to_apis`.`id_products`