app/Models/Category.php

    public static function countActiveCategory(){
        $data=Category::where('status','active')->count();
---
select count(*) as aggregate from `categories` where `status` = 'active'