app/Models/Product.php

    public static function getAllProduct()
    {
        return Product::with(['cat_info', 'sub_cat_info'])->orderBy('id', 'asc')->paginate(10);
---
select * from `products` order by `id` asc limit 10 offset 10
select count(*) as aggregate from `products`

    public static function countActiveProduct()
    {
        $data = Product::where('status', 'active')->count();
---
select count(*) as aggregate from `products` where `status` = 'active'